class Mystery():

    def __init__(self, question, answer, choices):
        self.question = question
        self.answer = answer
        self.choices = choices


city_category = {
    "Категория города":{
        "Города за 100": {
            "Какой город является столицей Канады?":  "Оттава",
            "В каком городе находится Эйфелева башня?":  "Париж",
            "Какой город является столицей Австралии?":  "Канберра"},

        "Города за 300": {
            "Какой город в мире считается самым высоко расположенным над уровнем моря?":  "Ла-Пас, Боливия",
            "Какой город в мире считается столицей архитектуры модернизма?":  "Барселона, Испания",
            "Какой город в мире называют 'городом будущего' благодаря использованию высоких технологий и"
            " инновационных решений?":  "Сингапур"},

        "Города за 500":{
            "Какой город считается самым ветреным в мире, по данным Гиннессовой книги рекордов?":
            "Веллингтон, Новая Зеландия",
            "Какой город в мире считается столицей космической промышленности?":  "Хьюстон, США",
            "В каком городе в мире находится самый старый поезд в мире, который еще работает на "
            "железнодорожной линии?":  "Кингстон-апон-Халл, Великобритания"}
}
}

country_category = {
    "Категория стран":{
        "Страны за 100": {
            "Какая страна является  самой малонаселенной страной Европы?": "Исландия",
            "Какая страна является самой населенной в мире?": "Китай",
            "В какой стране находится самая высокая гора в мире?": "Непал"},

        "Страны за 300": {
            "Какая страна является родиной самого популярного спортивного автомобиля - Формулы-1?": "Великобритания",
            "Какая страна является родиной изобретателя телефона Александра Белла?": "США",
            "В какой стране находится город Венеция, который является культурным и "
            "историческим наследием человечества по решению ЮНЕСКО?": "Италия"},

        "Страны за 500": {
            "Какая страна является родиной известного горнолыжного курорта Зермат?": "Швейцария",
            "Какая страна является родиной философа и математика Рене Декарта?": "Франция",
            "В какой стране находится один из семи чудес света - Тадж-Махал?": "Индия"}
}
}
population_category = {
    "Категория страны":{
        "Население за 100": {
            "Какая страна имеет самое большое население в мире?": "Китай",
            "Какая страна имеет самое маленькое население в мире?": "Ватикан",
            "Какая страна имеет самую высокую плотность населения в мире?": "Монако"},

        "Население за 300": {
            "Какая страна является самой многонациональной в мире?": "Индия",
            "Какая страна имеет самое быстрое растущее население в мире?": "Нигерия",
            "Какая страна имеет наибольшую долю молодого населения в мире?": "Мали"},

        "Население за 500": {
            "Какая страна является самой густонаселенной в Европе?": "Нидерланды",
            "Какая страна имеет наименьшую плотность населения в мире?": "Монголия",
            "Какая страна имеет самое высокое соотношение женщин к мужчинам в мире?": "Литва"}
    }
    }
